# -*- mode: org -*-

#+BEGIN_SRC sh :results output verbatim :exports both
make run CLASS=QuickUnionUF < ../../data/tinyUF.txt
#+END_SRC

#+RESULTS:
#+begin_example
4 3
3 8
6 5
9 4
2 1
5 0
7 2
6 1
2 components
id: [1, 1, 1, 8, 3, 0, 5, 1, 8, 8]
digraph {
  rankdir=BT
  0 -> 1
  2 -> 1
  3 -> 8
  4 -> 3
  5 -> 0
  6 -> 5
  7 -> 1
  9 -> 8
  {rank=same 1 8}
}

#+end_example
